In [1]:
import pandas as pd
import seaborn as sns

In [2]:
titanic =sns.load_dataset('titanic')
df=titanic.loc[:,['age','sex','class','fare','survived']]

In [3]:
grouped = df.groupby(['class','sex'])

In [4]:
gdf = grouped.mean()
print(gdf)
print()
print(type(gdf))

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

<class 'pandas.core.frame.DataFrame'>

In [6]:
gdf.loc['First']

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

In [7]:
gdf.loc[('First','female')]

age          34.611765
fare        106.125798
survived      0.968085
Name: (First, female), dtype: float64

In [10]:
gdf.xs('First', level ='class')

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

In [20]:
gdf.xs('First', level = 0)

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

In [11]:
Ff_df=gdf.loc[('First','female')]
type(Ff_df)

pandas.core.series.Series

In [12]:
idx = pd.MultiIndex.from_tuples([('A', 'x'), ('A', 'y'), ('B', 'x'), ('B', 'y')])
df_sample = pd.DataFrame(data=[1, 2, 3, 4], index=idx, columns=['Value'])

In [13]:
df_sample

     Value
A x      1
  y      2
B x      3
  y      4

In [16]:
df_sample.xs('A',level=0)

   Value
x      1
y      2

In [19]:
df_sample.xs('x',level=1)

   Value
A      1
B      3